In [30]:
import pandas as pd
import numpy as np
import csv

In [31]:
file = pd.read_csv("calificaciones_v2.csv")
file

     matricula  11111111
0       nombre  Alumno 1
1        grupo      TI11
2    Materia 1         1
3    Materia 2         8
4    Materia 3         1
..         ...       ...
428  Materia 3        10
429  Materia 4         6
430  Materia 5         8
431  Materia 6        10
432     estado   regular

[433 rows x 2 columns]

In [32]:
data = file.drop([7],axis=0)

In [33]:
data

     matricula  11111111
0       nombre  Alumno 1
1        grupo      TI11
2    Materia 1         1
3    Materia 2         8
4    Materia 3         1
..         ...       ...
428  Materia 3        10
429  Materia 4         6
430  Materia 5         8
431  Materia 6        10
432     estado   regular

[432 rows x 2 columns]

In [34]:
data.head(8)

   matricula  11111111
0     nombre  Alumno 1
1      grupo      TI11
2  Materia 1         1
3  Materia 2         8
4  Materia 3         1
5  Materia 4         7
6  Materia 5         2
8     estado   regular

In [35]:
data.tail(10)

     matricula   11111111
423  matricula   11111158
424     nombre  Alumno 48
425      grupo     IDGS71
426  Materia 1          4
427  Materia 2          4
428  Materia 3         10
429  Materia 4          6
430  Materia 5          8
431  Materia 6         10
432     estado    regular

In [36]:
data = data.drop([431],axis=0)

In [37]:
data

     matricula  11111111
0       nombre  Alumno 1
1        grupo      TI11
2    Materia 1         1
3    Materia 2         8
4    Materia 3         1
..         ...       ...
427  Materia 2         4
428  Materia 3        10
429  Materia 4         6
430  Materia 5         8
432     estado   regular

[431 rows x 2 columns]

In [38]:
new_file = data.to_csv("modificaciones.csv")

In [39]:
data = data.reindex()

In [40]:
file = data.to_csv("indexado.csv")

In [41]:
line = pd.DataFrame({"onset": 30.0, "length": 1.3}, index=[3])

In [42]:
line

   onset  length
3   30.0     1.3

In [43]:
line = pd.concat([line.iloc[:2], line, line.iloc[2:]])

In [44]:
line

   onset  length
3   30.0     1.3
3   30.0     1.3

In [45]:
fruit_list = [ ('Orange', 34, 'Yes' )]
df = pd.DataFrame(fruit_list, columns = ['Name' , 'Price', 'Stock'])

In [46]:
df

     Name  Price Stock
0  Orange     34   Yes

In [47]:
df.loc[1]=[ 'Mango', 4, 'No' ]
df.loc[2]=[ 'Apple', 14, 'Yes' ]

In [48]:
df

     Name  Price Stock
0  Orange     34   Yes
1   Mango      4    No
2   Apple     14   Yes

In [49]:
data.loc[234]=["Materia 5",0]

In [50]:
data = data.reindex()

In [51]:
file = data.to_csv("indexado.csv")